Revit 2024 API
RebarHostData.GetFabricSheetsInHost Method
 Returns all FabricSheet elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IList<FabricSheet> GetFabricSheetsInHost()
Visual Basic
Public Function GetFabricSheetsInHost As IList(Of FabricSheet)
Visual C++
public:
IList<FabricSheet^>^ GetFabricSheetsInHost()
See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace